use somali_cinema
go
delete
from movie
go
insert into movie
(movie_id, movie_type_id, city_id, movie_name, movie_publishing_data, movie_source_address,
 movie_poster_address, movie_duration_playback, movie_introduction)
values ('1001001001', '100000002', null, '霸王别姬', '2020-06-15', 'item.mi.com/1161200059.html',
        '/img/img6.jpeg', '2:51:0', '影片围绕两位京剧伶人半个世纪的悲欢离合，展现了对传统文化、人的生存状态及人性的思考与领悟。'),
       ('1001001002', '100000001', null, '心花怒放', '2020-09-30', 'www.mi.com/mibicycle/',
        '/img/img12.jpg', '1:57:32', '讲述了在生活中遭遇了情感危机的耿浩，好基友郝义为了帮助他摆脱痛苦，带着耿浩开始猎艳之旅。'),
       ('1001001003', '100000002', null, '刘姬传', '2020-05-15', 'www.mi.com/mitu/',
        '/img/img6.jpeg', '1:20:0', '影片围绕两位京剧伶人半个世纪的悲欢离合，展现了对传统文化、人的生存状态及人性的思考与领悟。'),
       ('1001001004', '100000002', null, '霸王别姬', '2020-06-15', 'item.mi.com/1161200059.html',
        '/img/img6.jpeg', '2:51:0', '影片围绕两位京剧伶人半个世纪的悲欢离合，展现了对传统文化、人的生存状态及人性的思考与领悟。'),
       ('1001001005', '100000002', null, '初恋十八', '2020-06-17', 'item.mi.com/1161200059.html',
        '/img/img1.jpg', '1:51:0', '不管你是青年，中年，还是已到暮年，在你的记忆深处，一定存在着一个TA，TA被称为初恋。'),
       ('1001001006', '100000002', null, '流浪地球', '2020-08-15', 'www.mi.com/ihealth/',
        '/img/img7.jpg', '2:17:0', '影片围绕两位京剧伶人半个世纪的悲欢离合，展现了对传统文化、人的生存状态及人性的思考与领悟。'),
       ('1001001007', '100000002', null, '初恋十八岁', '2020-06-17', 'item.mi.com/1161200059.html',
        '/img/img1.jpg', '2:51:0', '不管你是青年，中年，还是已到暮年，在你的记忆深处，一定存在着一个TA，TA被称为初恋。'),
       ('1001001008', '100000002', null, '霸王别姬', '2020-06-15', 'item.mi.com/1161200059.html',
        '/img/img6.jpeg', '2:51:0', '影片围绕两位京剧伶人半个世纪的悲欢离合，展现了对传统文化、人的生存状态及人性的思考与领悟。')
go

select *
from movie
go