use somali_cinema
go
delete
from movie
go
insert into movie
(movie_id, movie_type_id, city_id, movie_name, movie_publishing_data, movie_source_address,
 movie_poster_address, movie_duration_playback, movie_introduction)
values ('1001001001', '100000002', null, '霸王别姬', '2020-06-15', 'item.mi.com/1161200059.html',
        '/img/img6.jpeg', '2:51:0', '影片围绕两位京剧伶人半个世纪的悲欢离合，展现了对传统文化、人的生存状态及人性的思考与领悟。'),
       ('1001001002', '100000001', null, '心花怒放', '2020-09-30', 'www.mi.com/mibicycle/',
        '/img/img12.jpg', '1:57:32', '讲述了在生活中遭遇了情感危机的耿浩，好基友郝义为了帮助他摆脱痛苦，带着耿浩开始猎艳之旅。'),
       ('1001001003', '100000002', null, '刘姬传', '2020-05-15', 'www.mi.com/mitu/',
        '/img/img6.jpeg', '1:20:0', '影片围绕两位京剧伶人半个世纪的悲欢离合，展现了对传统文化、人的生存状态及人性的思考与领悟。'),
       ('1001001004', '100000002', null, '霸王别姬', '2020-06-15', 'item.mi.com/1161200059.html',
        '/img/img6.jpeg', '2:51:0', '影片围绕两位京剧伶人半个世纪的悲欢离合，展现了对传统文化、人的生存状态及人性的思考与领悟。'),
       ('1001001005', '100000002', null, '初恋十八', '2020-06-17', 'item.mi.com/1161200059.html',
        '/img/img1.jpg', '1:51:0', '不管你是青年，中年，还是已到暮年，在你的记忆深处，一定存在着一个TA，TA被称为初恋。'),
       ('1001001006', '100000002', null, '流浪地球', '2020-08-15', 'www.mi.com/ihealth/',
        '/img/img7.jpg', '2:17:0', '影片围绕两位京剧伶人半个世纪的悲欢离合，展现了对传统文化、人的生存状态及人性的思考与领悟。'),
       ('1001001007', '100000002', null, '初恋十八岁', '2020-06-17', 'item.mi.com/1161200059.html',
        '/img/img1.jpg', '2:51:0', '不管你是青年，中年，还是已到暮年，在你的记忆深处，一定存在着一个TA，TA被称为初恋。'),
       ('1001001008', '100000002', null, '霸王别姬', '2020-06-15', 'item.mi.com/1161200059.html',
        '/img/img6.jpeg', '2:51:0', '影片围绕两位京剧伶人半个世纪的悲欢离合，展现了对传统文化、人的生存状态及人性的思考与领悟。')
go


insert into movie
values ('1001001009', '100000004 ', '220600000000', '太极张三丰', '2019-06-30', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001011', '100000005 ', '222400000000', '太极张三丰', '2020-05-28', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001012', '100000007 ', '130400000000', '太极张三丰', '2020-05-31', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001013', '100000009 ', '340400000000', '太极张三丰', '2020-05-29', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001014', '100000010 ', '340700000000', '太极张三丰', '2020-06-01', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001015', '100000014 ', '130400000000', '太极张三丰', '2020-06-01', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001016', '100000002 ', '511400000000', '太极张三丰', '2020-05-30', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001017', '100000001 ', '511900000000', '太极张三丰', '2020-04-28', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001018', '100000007 ', '441700000000', '太极张三丰', '2020-04-30', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001019', '100000013 ', '130400000000', '太极张三丰', '2020-05-31', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001020', '100000015 ', '420500000000', '太极张三丰', '2020-04-30', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001021', '100000006 ', '610700000000', '太极张三丰', '2020-05-30', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001022', '100000005 ', '611000000000', '太极张三丰', '2020-05-30', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001023', '100000006 ', '654200000000', '太极张三丰', '2020-05-30', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001024', '100000003 ', '653000000000', '太极张三丰', '2020-04-30', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001025', '100000007 ', '511700000000', '太极张三丰', '2020-02-28', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001026', '100000009 ', '450400000000', '太极张三丰', '2020-02-28', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001027', '100000010 ', '450200000000', '太极张三丰', '2020-01-30', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001028', '100000011 ', '421000000000', '太极张三丰', '2020-07-30', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null),
       ('1001001029', '100000001 ', '370400000000', '太极张三丰', '2020-06-01', '讲述太极拳创始人张三丰青年时期的武学历程',
        'item.mi.com/1161200059.html', '/img/img6.jpeg', '1:37:29', null)
go

select *
from movie
go